#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.cialfo_alarm_myrds.aws_cloudwatch_metric_alarm.db-TransactionLogsDiskUsage: Refreshing state... [id=awsrds-db-TransactionLogsDiskUsage-myrds]
module.cialfo_alarm_myrds.aws_cloudwatch_metric_alarm.db-FreeStorageSpace: Refreshing state... [id=awsrds-db-FreeStorageSpace-myrds]
aws_db_instance.myrds: Refreshing state... [id=myrds]
aws_vpc.iac-p1: Refreshing state... [id=vpc-01fb97828d7676508]
module.cialfo_alarm_myrds.aws_cloudwatch_metric_alarm.db-DatabaseConnections: Refreshing state... [id=awsrds-db-DatabaseConnections-myrds]
module.cialfo_alarm_myrds.aws_cloudwatch_metric_alarm.db-CPUUtilization: Refreshing state... [id=awsrds-db-CPUUtilization-myrds]
module.cialfo_alarm_myrds.aws_cloudwatch_metric_alarm.db-FreeableMemory: Refreshing state... [id=awsrds-db-FreeableMemory-myrds]
module.cialfo_alarm_myrds.aws_cloudwatch_metric_alarm.db-SwapUsage: Refreshing state... [id=awsrds-db-SwapUsage-myrds]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cialfo_alarm_myrds1.aws_cloudwatch_metric_alarm.db-CPUUtilization will be created
  + resource "aws_cloudwatch_metric_alarm" "db-CPUUtilization" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ap-southeast-1:262772888739:send-alert",
        ]
      + alarm_description                     = "This metric monitors DB CPU Utilization"
      + alarm_name                            = "awsrds-db-CPUUtilization-myrds1"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "myrds1"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/RDS"
      + ok_actions                            = [
          + "arn:aws:sns:ap-southeast-1:262772888739:send-alert",
        ]
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 80
      + treat_missing_data                    = "missing"
    }

  # module.cialfo_alarm_myrds1.aws_cloudwatch_metric_alarm.db-DatabaseConnections will be created
  + resource "aws_cloudwatch_metric_alarm" "db-DatabaseConnections" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ap-southeast-1:262772888739:send-alert",
        ]
      + alarm_description                     = "This metric monitors DB Connection count"
      + alarm_name                            = "awsrds-db-DatabaseConnections-myrds1"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "myrds1"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "DatabaseConnections"
      + namespace                             = "AWS/RDS"
      + ok_actions                            = [
          + "arn:aws:sns:ap-southeast-1:262772888739:send-alert",
        ]
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 200
      + treat_missing_data                    = "missing"
    }

  # module.cialfo_alarm_myrds1.aws_cloudwatch_metric_alarm.db-FreeStorageSpace will be created
  + resource "aws_cloudwatch_metric_alarm" "db-FreeStorageSpace" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ap-southeast-1:262772888739:send-alert",
        ]
      + alarm_description                     = "This metric monitors DB FreeStorageSpace"
      + alarm_name                            = "awsrds-db-FreeStorageSpace-myrds1"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanOrEqualToThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "myrds1"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "FreeStorageSpace"
      + namespace                             = "AWS/RDS"
      + ok_actions                            = [
          + "arn:aws:sns:ap-southeast-1:262772888739:send-alert",
        ]
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 100000000
      + treat_missing_data                    = "missing"
    }

  # module.cialfo_alarm_myrds1.aws_cloudwatch_metric_alarm.db-FreeableMemory will be created
  + resource "aws_cloudwatch_metric_alarm" "db-FreeableMemory" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ap-southeast-1:262772888739:send-alert",
        ]
      + alarm_description                     = "This metric monitors DB FreeableMemory"
      + alarm_name                            = "awsrds-db-FreeableMemory-myrds1"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanOrEqualToThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "myrds1"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "FreeableMemory"
      + namespace                             = "AWS/RDS"
      + ok_actions                            = [
          + "arn:aws:sns:ap-southeast-1:262772888739:send-alert",
        ]
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 300000000
      + treat_missing_data                    = "missing"
    }

  # module.cialfo_alarm_myrds1.aws_cloudwatch_metric_alarm.db-SwapUsage will be created
  + resource "aws_cloudwatch_metric_alarm" "db-SwapUsage" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ap-southeast-1:262772888739:send-alert",
        ]
      + alarm_description                     = "This metric monitors DB Swap space"
      + alarm_name                            = "awsrds-db-SwapUsage-myrds1"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "myrds1"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "SwapUsage"
      + namespace                             = "AWS/RDS"
      + ok_actions                            = [
          + "arn:aws:sns:ap-southeast-1:262772888739:send-alert",
        ]
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 4000000000
      + treat_missing_data                    = "missing"
    }

  # module.cialfo_alarm_myrds1.aws_cloudwatch_metric_alarm.db-TransactionLogsDiskUsage will be created
  + resource "aws_cloudwatch_metric_alarm" "db-TransactionLogsDiskUsage" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ap-southeast-1:262772888739:send-alert",
        ]
      + alarm_description                     = "This metric monitors DB TransactionLogsDiskUsage"
      + alarm_name                            = "awsrds-db-TransactionLogsDiskUsage-myrds1"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "myrds1"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "TransactionLogsDiskUsage"
      + namespace                             = "AWS/RDS"
      + ok_actions                            = [
          + "arn:aws:sns:ap-southeast-1:262772888739:send-alert",
        ]
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 50000000000
      + treat_missing_data                    = "missing"
    }

  # module.cialfo_alarm_myrds2.aws_cloudwatch_metric_alarm.db-CPUUtilization will be created
  + resource "aws_cloudwatch_metric_alarm" "db-CPUUtilization" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ap-southeast-1:262772888739:send-alert",
        ]
      + alarm_description                     = "This metric monitors DB CPU Utilization"
      + alarm_name                            = "awsrds-db-CPUUtilization-myrds2"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "myrds2"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/RDS"
      + ok_actions                            = [
          + "arn:aws:sns:ap-southeast-1:262772888739:send-alert",
        ]
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 80
      + treat_missing_data                    = "missing"
    }

  # module.cialfo_alarm_myrds2.aws_cloudwatch_metric_alarm.db-DatabaseConnections will be created
  + resource "aws_cloudwatch_metric_alarm" "db-DatabaseConnections" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ap-southeast-1:262772888739:send-alert",
        ]
      + alarm_description                     = "This metric monitors DB Connection count"
      + alarm_name                            = "awsrds-db-DatabaseConnections-myrds2"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "myrds2"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "DatabaseConnections"
      + namespace                             = "AWS/RDS"
      + ok_actions                            = [
          + "arn:aws:sns:ap-southeast-1:262772888739:send-alert",
        ]
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 200
      + treat_missing_data                    = "missing"
    }

  # module.cialfo_alarm_myrds2.aws_cloudwatch_metric_alarm.db-FreeStorageSpace will be created
  + resource "aws_cloudwatch_metric_alarm" "db-FreeStorageSpace" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ap-southeast-1:262772888739:send-alert",
        ]
      + alarm_description                     = "This metric monitors DB FreeStorageSpace"
      + alarm_name                            = "awsrds-db-FreeStorageSpace-myrds2"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanOrEqualToThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "myrds2"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "FreeStorageSpace"
      + namespace                             = "AWS/RDS"
      + ok_actions                            = [
          + "arn:aws:sns:ap-southeast-1:262772888739:send-alert",
        ]
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 100000000
      + treat_missing_data                    = "missing"
    }

  # module.cialfo_alarm_myrds2.aws_cloudwatch_metric_alarm.db-FreeableMemory will be created
  + resource "aws_cloudwatch_metric_alarm" "db-FreeableMemory" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ap-southeast-1:262772888739:send-alert",
        ]
      + alarm_description                     = "This metric monitors DB FreeableMemory"
      + alarm_name                            = "awsrds-db-FreeableMemory-myrds2"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanOrEqualToThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "myrds2"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "FreeableMemory"
      + namespace                             = "AWS/RDS"
      + ok_actions                            = [
          + "arn:aws:sns:ap-southeast-1:262772888739:send-alert",
        ]
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 300000000
      + treat_missing_data                    = "missing"
    }

  # module.cialfo_alarm_myrds2.aws_cloudwatch_metric_alarm.db-SwapUsage will be created
  + resource "aws_cloudwatch_metric_alarm" "db-SwapUsage" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ap-southeast-1:262772888739:send-alert",
        ]
      + alarm_description                     = "This metric monitors DB Swap space"
      + alarm_name                            = "awsrds-db-SwapUsage-myrds2"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "myrds2"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "SwapUsage"
      + namespace                             = "AWS/RDS"
      + ok_actions                            = [
          + "arn:aws:sns:ap-southeast-1:262772888739:send-alert",
        ]
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 4000000000
      + treat_missing_data                    = "missing"
    }

  # module.cialfo_alarm_myrds2.aws_cloudwatch_metric_alarm.db-TransactionLogsDiskUsage will be created
  + resource "aws_cloudwatch_metric_alarm" "db-TransactionLogsDiskUsage" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ap-southeast-1:262772888739:send-alert",
        ]
      + alarm_description                     = "This metric monitors DB TransactionLogsDiskUsage"
      + alarm_name                            = "awsrds-db-TransactionLogsDiskUsage-myrds2"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "myrds2"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "TransactionLogsDiskUsage"
      + namespace                             = "AWS/RDS"
      + ok_actions                            = [
          + "arn:aws:sns:ap-southeast-1:262772888739:send-alert",
        ]
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 50000000000
      + treat_missing_data                    = "missing"
    }

Plan: 12 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @makwanji, Action: `pull_request`*